//Напишите программу, которая на вход принимает число и выдает его квадрат
Console.WriteLine("Введите число:");
int n = int.Parse(Console.ReadLine());
Console.WriteLine("Число: " + n);
Console.WriteLine("Квадрат: " + n * n);